<?php

return [

    'accepted' => 'Необходимо принять :attribute.',
    'confirmed' => 'Пароли не совпадают.',
    'email' => 'Поле «:attribute» должно содержать корректный email.',
    'max' => [
        'string' => 'Поле «:attribute» не должно быть длиннее :max символов.',
    ],
    'required' => 'Поле «:attribute» обязательно для заполнения.',
    'unique' => 'Такой :attribute уже зарегистрирован.',

    'password' => [
        'letters' => 'Пароль должен содержать хотя бы одну букву.',
        'mixed' => 'Пароль должен содержать буквы в разных регистрах.',
        'numbers' => 'Пароль должен содержать хотя бы одну цифру.',
        'symbols' => 'Пароль должен содержать хотя бы один спецсимвол.',
        'uncompromised' => 'Этот пароль встречался в утечках данных. Выберите другой.',
    ],

    'attributes' => [
        'name' => 'имя',
        'email' => 'электронная почта',
        'password' => 'пароль',
        'password_confirmation' => 'подтверждение пароля',
        'captcha_token' => 'проверка капчи',
    ],

];
